a, b = map(float, input().split())
if a > b:
    print(a)
else:
    print(b)
#----------------------------------------------------------------
a = input().lower()
if a[::1] == a[::-1]:
    print("ДА")
else:
    print("НЕТ")
#----------------------------------------------------------------
m, n = map(int, input().split())
if m % n == 0:
    print(int(m / n))
else:
    print(f"{m} на {n} нацело не делится")
#----------------------------------------------------------------
a, b, c = map(int, input().split())
if (a**2)+(b**2)==(c**2):
    print("ДА")
else:
    print("НЕТ")
#----------------------------------------------------------------
a = input()
if int(a[-1]) == 7:
    print("ДА")
else:
    print("НЕТ")
#----------------------------------------------------------------
a = input()
if 't' in a and 'h' in a and 'o' in a:
    print("ДА")
else:
    print("НЕТ")
#-----------------------------------------------------------------
lst = list(map(str, (input().split())))
if "Москва" in lst:
    lst.remove("Москва")
print(*lst)
#-----------------------------------------------------------------
a,b,c,d=map(int,input().split())
if b > a:
     a, b = b, a
if d > c:
     c, d = d, c
if (a - c >= 2 and b - d >= 2):
     print('ДА')
else:
     print('НЕТ')
#-----------------------------------------------------------------
a = list(map(int,input()))
if a[0]+a[1]+a[2] == a[-1]+a[-2]+a[-3]:
    print("ДА")
else:
    print("НЕТ")
#-----------------------------------------------------------------
print('green' if 0 <= float(input()) % 5 <= 3 else 'red')
